#--coding:utf-8--
import gensim
from gensim.models.word2vec import Word2Vec
from visualizer import CostumVisualizer
path = "./sgns.target.word-word.dynwin5.thr10.neg5.dim300.iter5"


def loadWord2Vec(filename):
    vocab = []
    embd = []
    cnt = 0
    fr = open(filename, 'r', encoding="utf-8")
    line = fr.readline().strip()
    word_dim = int(line.split(' ')[1])
    vocab.append("unk")
    embd.append([0]*word_dim)
    for line in fr :
        row = line.strip().split(' ')
        vocab.append(row[0]) #把token加入vocab中
        embd.append(row[1:]) #embedding部分
    print("loaded word2vec")
    fr.close()
    return vocab,embd

vocab,embed = loadWord2Vec(path)
#words = ['流体力学', '量纲分析', '亟待解决', '各种因素', '广泛应用', '总的说来', '社会变革', '机器翻译', '人工干预', '守恒定律', '联系实际', '化学反应', '难以实现', '对系统', '定性分析', '识别系统', '线性组合', '微分方程', '值得注意', '长时间', '识别方法', '相关性', '不必要', '差异性', '各向异性', '可压缩', '概率分析', '最小值', '应用领域', '组合成', '相互作用', '自动化', '数以千计', '十分必要', '并不多', '劳动强度', '可信度', '各向同性', '并不需要', '初始条件', '两者之间', '密切相关', '表达方式', '数据分析', '定常流动', '多项式', '线性系统', '最终目标', '聚类分析', '相关联', '控制系统', '饱和状态', '此基础', '点估计', '真实气体', '综合利用', '意想不到', '归纳起来', '化零为整', '静力学', '过高估计', '耐久度', '化中', '必不可少', '大幅提高', '各种各样', '至关重要', '一体化', '发生变化', '针对实际', '组合而成', '通过观察', '近几年', '有所提高', '不可避免', '发生器', '发展趋势']
words = ['人工智能', '世纪', '科技', '时代', '领域', '研究者', '话题', '智能', '角度', '内涵', '内容', '总结', '产生', '数据', '天生', '大', '神经网络', '森林', '机器', '方法', '利用', '替代', '理论', '层面', '人脑', '范式', '方程', '湍流', '模型', '物理', '标度', '数值', '技术', '信息', '海量', '数据挖掘', '气动', '学科', '建模', '工程', '外形', '适应控制', '方面', '关键词', '数学家', '物理学家', '贡献', '基本', '弟子', '开创性', '经典', '定律', '数学', '问题', '时', '风洞试验', '实际', '有力', '成本', '复杂性', '基础性', '系统', '手段', '机理', '现象', '描述性', '机制', '因果关系', '精细化', '特征分析', '人', '科学', '计算机', '分支', '世界', '尖端技术', '空间', '能源技术', '基因工程', '成果', '教授', '定义', '人才', '思想', '目标', '胜任', '人类', '国际象棋', '界', '棋王', '人们', '力量', '公司', '狗', '战胜', '世界冠军', '计算机本身', '棋手', '目的', '功力', '命运', '语言', '图像', '程序设计', '信息处理', '储存', '交通', '医疗', '金融', '方方面面', '前景', '规划', '年度', '媒体', '流行语', '途径', '高精度', '格式', '计算方法', '研究成果', '方向', '型号', '步伐', '结合点', '空气', '动力学', '专著', '航空航天', '视角', '基础', '经验', '名词', '概念', '文献', '物理学', '数理', '工作者', '专业', '公式', '前人', '前提', '流体', '精度', '计算成本', '思路', '部分', '样本', '条件', '量纲', '特性', '环境', '过程', '时间', '规律', '意义', '原理', '流', '特点', '大量', '突破口', '学者', '向量', '能力', '黑箱', '区域', '性', '着力', '符号', '编程', '所需', '终端', '常数', '函数', '运算符', '种群', '个体', '适应度', '交叉', '变异', '图', '工程界', '形式', '计算速度', '函数库', '典型', '结构', '项', '圆柱', '绕流', '低维', '地下水', '污染物', '代数', '桥梁', '涡致', '特征', '偏', '偏微分', '微分', '噪声', '卷积', '参数', '适用范围', '情况', '标量', '系数', '数据量', '正则', '化项', '传统', '分子', '流场', '误差', '滤波', '噪', '原则', '指导性', '导数', '方程组', '方式', '物理量', '小', '精准', '棘手', '选项', '准则', '项在备', '守恒性', '基石', '壁面', 
 '距离', '涡', '关系式', '代数式', '平板', '管道', '理论指导', '结果', '适用性', '使用者', '热点', '灰箱', '偏差', '原', '计算精度', '计算结果', '值', '高分辨率', '准确性', '山算例', '剪切应力', '基', '刻画', '旋涡', '波形', '结果表明', '亚声速', '状态', '算例', '效率', '局面', '化', '格子', '分量', '人工神经网络', '人工', '网络', '时空', '框架', '程度', '证实', '可行性', '灵敏度', '分类器', '参考文献', '流程', '数据处理', '种类', '分类', '通用性', '界定', '研究所', '宽度', '关系', '策略', '架构', '精简', '模式', '单向', '双向', '器', '应力场', '或涡', '黏场', '湍', '动能', '无法', '充分发挥', '自主性', '针对性', '先验', '本质', '精确性', '解释性', '系统地', '效果', '损失', '指导', '精确度', '一致性', '复杂度', '考量', '片面', '阶段', '边界', '范围', '人员', '信心', '性能', '稳定性', '速度', '物', '局部', '峰值', '光滑性', '时刻', '全部', '变差', '极值', '措施', '对模型', '预测值', '终值', '报告', '为涡', '黏', '属性', '联系', '单', '数目', '无量', '纲量', '核心', '常量', '单位制', '量', '临界现象', '唯象理论', '尺度', '数量', '随机性', '规则性', '幂', '次律', '定量', '指数', '刻划', '能谱', '惯性', '子区', '里程碑', '方法论', '机遇', '纲', '传感器', '优势', '颗粒', '纲组', '重要性', '降维', '信号', '装置', '等离子体', '模', '阈值', '权值', '超平面', '算法', '工程师', '共性', '科学家', '力学', '超声速', '飞行器', '试验设备', '线性', '全', '方案', '自动检测', '插值', '气动力', '可视化', '步骤', '原始数据', '曲线', '核', '高', '尖锥', '阻力', '中将', '参量', '性质', '关心', '难题', '前', '自然界', '网格', '剖分', '结构化', '变形', '软件', '对流', '后置', '域', '代数方程', '来源', '攻角', 
 '训练样本', '预测出', '层流', '数据库', '表面', '压力', '力矩', '迎角', '图象', '附面层', '壁区', '量级', '升力', '低分辨率', '重构', '高分', '辦率', '有效性', '池化', '边界条件', '涡街', '时变', '其本质', '约束条件', '乘子', '法', '来流', '子', '激波', '标签', '编码', '解码', '大大降低', '代理', '残差', '椭圆型', '血管', '步长', '边界层', '摩擦阻力', '关键', '代价', '参考点', '外力', '变分法', '乘子法', '分析方法', '观测点', '不确定性', '声速', '标定', '法则', '限制器', '积极探索', '深入研究', '关键问题', '降維', '精准度', '数字化', '耗时', '课题', '模块', '模态', '渠道', '分解成', '成分', '坐标系', '内', '本征', '能量', '频率', '保证数据', '投影', '范数', '实际操作', '排序', '线化', '源代码', '降阶', '导致系统', '集中力', '气动弹性', '输入输出', '算子', '低阶', '特征向量', '特征值', '增长率', '周期性', '演化过程', '序列', '直观', '标准', '指标', '伪', '压气机', '量指', '流形', '快照', '内在联系', '观点', '维流形', '维空间', '度量', '等距', '相似性', '编码器', '火焰', '心雨', '粒子', '样条', '类别', '基降维', '有所', '基法', '指', '输出量', '面向', '可控性', '瞬态', '平衡点', '整体', '全局', '上将', '错', '维点', '工具', '测量点', '切入点', '文', '方腔', '射流', '精度高', '洞壁', '支架', '效应', '客观', '发动机', '辦识', '风洞', '高性能', '模拟系统', '短时间', '限度', '设计所', '历史', '重复性', '背景', '代表', '多源', '对象', '飞行数据', '天地', '充分利用', '全面', '节', '差异', '动态', '趋同', '准度', '利用效率', '数据源', '区分', '周期长', '径向', '适应能力', '区间', '包线', '机动', '重点', '图像处理', '障碍物', '关联性', '价值', '结论', '数字', '环节', '动力', '困境', '风险', '有机', '挑战性', '任性', '实质', '风', '能源', '热', '普遍性', '笼统', '工程设计', '新思路', '架构设计', '关键技术', '线化势', '级数', '振幅', '分层', '机', '短时记忆', '振型', '锁频', '控制率', '表面温度', '热流', '代表性', '工况', '物面', '全局性', '普适性', '外缘', '舵面', '温度', '温度梯度', '阶', '阵', '小时', '约束力', '双重', '薄壁', '薄膜', '热带', '反作用', '壁板', '时域', '刚体', '弹性体', '静', '分析模型', '载荷', '规模', '技术性', '降阶是', '热传导', '温度场', '场会', '变性', '可行性研究', '因素', '感觉', '云雾', '革命性', '音障', '突破性', '设计者', '水平', '篇幅', '遗传算法', '群', '差分', '要素', '形状', '面', '离线', '点数', '加点', '势必会', '技术难题', '品质', '次数', '维数', '专家', '设计师', '促进作用', '算力', '进程', '闭环控制', '极具', '实际意义', '控制策略', '控制器', '阶数', '动', '全阶', '模糊控制', '集合论', '逻辑推理', '数学模型', '规则', '滑模', '尾迹', '漩涡', '涡激', '阵风', '风能', '输出功率', '摩擦力', '前缘', '吸力', '涡流', '搜索算法', '表达式', '根是', '矢量', '节点', '叶', '子树', '台阶', '斜坡', '证明', '最优控制', '微', '新', '车型', '幅值', '几秒钟', '详细描述', '著作', '解决问题', '基本模式', '动作', '报酬', '实数', '总和', '任务', '质量', '作动器', '聚类', '流控制', '大涡', '执行机构', '吸气', '功率', '消耗', '控制精度', '库', '缺点', '设计方案', '原因', '并行性', '化是', '时滞', '机构', '理念', '射流技术', '记忆合金', '微结构', '材料', '敏感性', '研究进展', '卡脖子', '主导作用', '指导作用', '互联网', '发挥作用', '瓶颈', '学术', '讲座', '航空', '学报', '编辑部', '专刊', '整理', '成文', '豆子', '青年教师', '研究生']
embeddings_dict= {}
for word in words:
    try:
        index = vocab.index(word)
        embeddings_dict[word] = embed[index]
    except ValueError:
        print(word +  'not in vocabulary')
    
print(embeddings_dict)
#CostumVisualizer.visualize_pca(embeddings_dict)
CostumVisualizer.visualize_tsne1(embeddings_dict,2)